<?php

namespace Database\Seeders;

use App\Models\School;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class SchoolSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $schools = [
            ['id' => '1',   'name' => 'مدرسة علي عبد المحسن الصقلاوي الابتدائية للبنين'            ],
            ['id' => '2',   'name' => 'ثانوية الفروانية للبنات'                                    ],
            ['id' => '3',   'name' => 'مدرسة ابراهيم مهنا المهنا المتوسطة للبنين'                  ],
            ['id' => '4',   'name' => 'مدرسة الوليد بن عبد الملك الابتدائية للبنين'                ],
            ['id' => '5',   'name' => 'مدرسة شملان بن علي المتوسطة للبنين'                         ],
            ['id' => '6',   'name' => 'مدرسة رقية المتوسطة للبنات'                                 ],
            ['id' => '7',   'name' => 'ثانوية الرابية للبنات'                                      ],
            ['id' => '8',   'name' => 'مدرسة زيد الحرب الابتدائية للبنبن'                          ],
            ['id' => '9',   'name' => 'ثانوية حواء بنت يزيد الأنصارية للبنات'                      ],
            ['id' => '10',  'name' => 'ثانوية سلمان الفارسي للبنين'                                ],
            ['id' => '11',  'name' => 'مدرسة عبدالله الرومي الابتدائية للبنين'                     ],
            ['id' => '12',  'name' => 'مدرسة سلمى بنت عميس الابتدائية للبنات'                      ],
            ['id' => '13',  'name' => 'مدرسة محمد ناهض العتيبي المتوسطة للبنين'                    ],
            ['id' => '14',  'name' => 'مدرسة أميمة بنت النعمان المتوسطة للبنات'                    ],
            ['id' => '15',  'name' => 'مدرسة صالح الرويح المتوسطة للبنين'                          ],
            ['id' => '16',  'name' => 'مدرسة ام الخير الابتدائية للبنات'                           ],
            ['id' => '17',  'name' => 'مدرسة الشدادية المتوسطة للبنين'                             ],
            ['id' => '18',  'name' => 'مدرسة العبدلية المتوسطة للبنات'                             ],
            ['id' => '19',  'name' => 'ثانوية سعد العبدالله للبنين'                                ],
            ['id' => '20',  'name' => 'ثانوية نورية الصبيح للبنات'                                 ],
            ['id' => '21',  'name' => 'مدرسة محمد صالح العدساني الابتدائية للبنين'                 ],
            ['id' => '22',  'name' => 'مدرسة المقداد بن الأسود المتوسطة للبنين'                    ],
            ['id' => '23',  'name' => 'مدرسة الواحة الابتدائية للبنات'                             ],
            ['id' => '24',  'name' => 'مدرسة بشيرة بنت النعمان الابتدائية للبنات'                  ],
            ['id' => '25',  'name' => 'مدرسة ام البراء بنت صفوان الابتدائية للبنات'                ],
            ['id' => '26',  'name' => 'مدرسة سيد هاشم الحنيان الابتدائية للبنين'                   ],
            ['id' => '27',  'name' => 'ثانوية امنه بنت الأرقم المخزومية للبنات'                    ],
            ['id' => '28',  'name' => 'مدرسة جميلة طنا العنزي الابتدائية للبنات'                   ],

        ];
        School::insert($schools);   
     }
}
